# Homework_2
# 1. Користувач вводить три цифри з клавіатури. Залежно від вибору користувача програма
# виводить на екран максимум із трьох, мінімум із трьох або середньоарифметичне трьох чисел.
# 2. Користувач вводить з клавіатури кількість метрів.
# Залежно від вибору користувача програма переводить метри милі, дюйми або ярди.

############ Task_1

n1 = int(input("Введіть перше число: "))
n2 = int(input("Введіть друге число: "))
n3 = int(input("Введіть третє число: "))

choice = int(input("Оберіть операцію (1 - максимум, 2 - мінімум, 3 - середнє арифметичне): "))

if choice == 1:
    if n1 >= n2 and n1 >= n3:
        print(f"Максимум: {n1}")
    elif n2 >= n1 and n2 >= n3:
        print(f"Максимум: {n2}")
    elif n3 >= n2 and n3 >= n1:
        print(f"Максимум: {n3}")
    else:
        print("Всі числа рівні")

elif choice == 2:
    if n1 <= n2 and n1 <= n3:
        print(f"Мінімум: {n1}")
    elif n2 <= n1 and n2 <= n3:
        print(f"Мінімум: {n2}")
    elif n3 <= n2 and n3 <= n1:
        print(f"Мінімум: {n3}")
    else:
        print("Всі числа рівні")
elif choice == 3:
    result = (n1 + n2 + n3)/3
    print(f"Середнє арифметичне: {result}")
else:
    print("Невірний вибір. Оберіть 1, 2 або 3.")